<?php
/**
 +----------------------------------------------------------
 * 获取资源配置信息
 +----------------------------------------------------------
 * @return	Array 资源配置信息
 * @author	美美2013-3-4
 +----------------------------------------------------------
 * 创建时间：	2013-3-4 上午03:06:39
 +----------------------------------------------------------
 */
function getConfig($key=NULL){
	$config = model('Xdata')->lget('resource');
	$config['limitpage']    || $config['limitpage'] =20;
	$config['server']    || $config['server'] ='';
	$config['credit'] || $config['credit']='score';
	if($key){
		return $config[$key];
	}else{
		return $config;
	}
}

/**
 +----------------------------------------------------------
 * 获取字典表里资源名称
 +----------------------------------------------------------
 * @param	String $dictionary 字典表里名称
 * @return	String 字典表里中文名
 * @author	美美2013-3-4
 +----------------------------------------------------------
 * 创建时间：	2013-3-4 上午03:07:34
 +----------------------------------------------------------
 */
function getDictionary($dictionary){
	$obj=M('category_dictionary')->field('DataName')->where("DataCode='$dictionary'")->find();
	return $obj['DataName'];
}

/**
 +----------------------------------------------------------
 * 根据courseid获取Course名字
 +----------------------------------------------------------
 * @param	int $courseid 课程id
 * @author	小朱 2013-8-2
 +----------------------------------------------------------
 * 创建时间：	2013-8-2 上午06:32:27
 +----------------------------------------------------------
 */
function getCourse($courseid){
	$obj=M('category_knowledge')->field('Course')->where("CourseID='$courseid'")->find();
	return $obj['Course'];
}

/**
 +----------------------------------------------------------
 * 获取文件大小，保留两位小数
 +----------------------------------------------------------
 * @param	$obj 文件大小
 * @return	String 文件大小（M,KB）
 * @author	美美2013-3-4
 +----------------------------------------------------------
 * 创建时间：	2013-3-4 上午03:02:50
 +----------------------------------------------------------
 */
function getSize($obj){
	if($obj>1024){
		$size=number_format(($obj/1024),2,'.','').'KB';
	}else if($obj>1048576){
		$size=number_format(($obj/1048576),2,'.','').'MB';
	}else{
		$size=$obj.'KB';
	}
	return $size;
}

/**
 +----------------------------------------------------------
 * 获取该资源收藏数
 +----------------------------------------------------------
 * @param	<按照参数定义顺序(没有参数的方法就不用该选项)>
 * @return	return_type <返回类型(void的方法就不用该选项)>
 * @author	小朱 2013-8-2
 +----------------------------------------------------------
 * 创建时间：	2013-8-2 上午06:36:09
 +----------------------------------------------------------
 */
function get_collect($id){
	$collect = M('favorite')->field('count(id) as count')->where("appname='resource' and fid=".$id)->find();
	return $collect['count'];
}

?>