<?php
 /**
 +------------------------------------------------------------------------------
 * ESN 班级空间荣誉接收人模型 Model
 +------------------------------------------------------------------------------
 * @category	ESN HonorListModel
 * @package		ESN Lib/Model
 * @author		小朱 <changqizhu@gridinfo.com.cn>
 * @version		1.0
 +------------------------------------------------------------------------------
 * 创建时间：	2013-3-4 上午10:48:18
 +------------------------------------------------------------------------------
 */
class HonorListModel extends Model{
		var $tableName = 'class_honor_list';
   }