<?php
/**
 +------------------------------------------------------------------------------
 * ESN 班级空间管理权限类型 Model
 +------------------------------------------------------------------------------
 * @category	ESN ManagerModel
 * @package		ESN Lib/Model
 * @author		小朱 <changqizhu@gridinfo.com.cn>
 * @version		1.0
 +------------------------------------------------------------------------------
 * 创建时间：	2013-3-4 上午10:48:18
 +------------------------------------------------------------------------------
 */
class ManagerModel extends Model{
		var $tableName = 'class_manager';
   }