<?php
/**
 +------------------------------------------------------------------------------
 * ESN 班级空间选课表 Model
 +------------------------------------------------------------------------------
 * @category	ESN SubjectModel
 * @package		ESN Lib/Model
 * @author		小朱 <changqizhu@gridinfo.com.cn>
 * @version		1.0
 +------------------------------------------------------------------------------
 * 创建时间：	2013-3-4 上午10:48:18
 +------------------------------------------------------------------------------
 */
class SubjectModel extends Model{
		var $tableName = 'class_per_subject';
	/**
	 +----------------------------------------------------------
	 * 班级选课公用方法
	 +----------------------------------------------------------
	 * @return	array result 班级选择的课程信息
	 * @author	小朱 2013-3-4
	 +----------------------------------------------------------
	 * 创建时间：	2013-3-4 下午01:31:29
	 +----------------------------------------------------------
	 */
	public  function _subject($classid){
		$result=D('Subject')->where('classid='.$classid)->findall();
		return $result;
	}
}