<?php
/**
 +------------------------------------------------------------------------------
 * 评论相关模块Action
 +------------------------------------------------------------------------------
 * @category	desktop
 * @package		Lib/Action
 * @author		小波 <xiaobosun@gridinfo.com.cn>
 * @version		1.0
 +------------------------------------------------------------------------------
 * 创建时间：	2013-3-22 下午17:55:54
 +------------------------------------------------------------------------------
 */
class CommentAction extends BaseAction{
	
	public function _initialize() {
		parent::_initialize();
	}

    /**
     +----------------------------------------------------------
     * ajax相关操作方法
     +----------------------------------------------------------
     * @author 小波
     +----------------------------------------------------------
     * 创建时间：2013-4-11 下午1:58:20
     +----------------------------------------------------------
     */
    public function ajax(){
    	$_GET['do'] || $_GET['do'] = $_POST['do'];
    	if (!empty($_GET['do'])) {
    		$this->$_GET['do']();
    	}
    }
    
    private function commentform(){
    	$data['id'] = intval($_GET['id']);
    	$data['idtype'] = trim($_GET['idtype']);
    	$this->assign($data);
    	$this->display('commentform');
    }
}
?>