<?php
/**
 +------------------------------------------------------------------------------
 * 主题设置相关Action
 +------------------------------------------------------------------------------
 * @category	desktop
 * @package		Lib/Action
 * @author		小波 <xiaobosun@gridinfo.com.cn>
 * @version		1.0
 +------------------------------------------------------------------------------
 * 创建时间：	2013-3-20 下午3:15:24
 +------------------------------------------------------------------------------
 */
class ThameAction extends BaseAction{
	public function _initialize() {
		parent::_initialize();
		
		//将当前执行的方法当作值存在模板变量do中
		if (defined('ACTION_NAME')){
			//当前执行的方法
			$this->assign('do',(ACTION_NAME=='index'?'systhame':ACTION_NAME));
		}
	}

	/**
	 +----------------------------------------------------------
	 * 索引入口
	 +----------------------------------------------------------
	 * @author 小波
	 +----------------------------------------------------------
	 * 创建时间：2013-3-20 下午3:15:24
	 +----------------------------------------------------------
	 */
	public function index(){
		$this->systhame();
    }
    
    /**
     +----------------------------------------------------------
     * 系统主题相关设置
     +----------------------------------------------------------
     * @author 小波
     +----------------------------------------------------------
     * 创建时间：2013-3-20 下午3:21:06
     +----------------------------------------------------------
     */
    public function systhame(){
    	$data = M('dsk_thame')->order('disp')->findPage(12);
    	foreach ($data['data'] as &$value){
    		if(!$value['backimg']) $value['backimg']=__THEME__.'/desktop/styles/thame/'.$value['folder'].'/back.jpg';
    		$thames[$value['folder']]=$value;
    	}
    	//重新格式化分页展示样式
    	$data['html'] = showPage($data['totalRows'],$data['nowPage'],$data['totalPages']);
    	
    	$data['thamejson'] = json_encode($thames);
    	$this->assign($data);
    	$this->display('systhame');
    }

    /**
     +----------------------------------------------------------
     * 颜色及壁纸设置功能
     +----------------------------------------------------------
     * @author 小波
     +----------------------------------------------------------
     * 创建时间：2013-3-21 下午4:04:13
     +----------------------------------------------------------
     */
    public function color(){
    	$data = M('dsk_wallpaper')->where("type='color'")->order('disp')->findPage(12);
    	$this->assign($data);
    	$this->display();
    }
    
    /**
     +----------------------------------------------------------
     * 平铺及拉伸图片设置通用方法
     +----------------------------------------------------------
     * @author 小波
     +----------------------------------------------------------
     * 创建时间：2013-3-22 上午11:28:04
     +----------------------------------------------------------
     */
    private function _wallpaperSet(){
    	$do = ACTION_NAME;
    	$classid=intval($_GET['classid']);
    	$class = M('dsk_wallpaper_class')->where("type='{$do}'")->order('disp')->findAll();
    	$param['type'] = $do;
    	if($classid) $param['classid'] = $classid;
    	$data = M('dsk_wallpaper')->where($param)->order('disp')->findPage(12);
    	foreach ($data['data'] as &$value){
    		if($value['thumb']) $value['thumbpic']=$value['val'].'.thumb.jpg';
    		else $value['thumbpic']=$value['val'];
    	}
    	//重新格式化分页展示样式
    	$data['html'] = showPage($data['totalRows'],$data['nowPage'],$data['totalPages']);
    	
    	$data['classid'] = $classid;
    	$data['class'] = $class;
    	$this->assign($data);
    }
    /**
     +----------------------------------------------------------
     * 平铺图片壁纸设置功能
     +----------------------------------------------------------
     * @author 小波
     +----------------------------------------------------------
     * 创建时间：2013-3-21 下午5:31:01
     +----------------------------------------------------------
     */
    public function repeat(){
    	$this->_wallpaperSet();
    	$this->display();
    }
    
    /**
     +----------------------------------------------------------
     * 拉伸图片壁纸设置功能
     +----------------------------------------------------------
     * @author 小波
     +----------------------------------------------------------
     * 创建时间：2013-3-22 上午11:23:08
     +----------------------------------------------------------
     */
    public function scale(){
    	$this->_wallpaperSet();
    	$this->display();
    }
    
    /**
     +----------------------------------------------------------
     * 动态图片壁纸设置功能
     +----------------------------------------------------------
     * @author 小波
     +----------------------------------------------------------
     * 创建时间：2013-3-22 上午11:24:13
     +----------------------------------------------------------
     */
    public function url(){
    	$do = ACTION_NAME;
    	$classid=intval($_GET['classid']);
    	$class = M('dsk_wallpaper_class')->where("type='{$do}'")->order('disp')->findAll();
    	$param['type'] = $do;
    	if($classid) $param['classid'] = $classid;
    	$data = M('dsk_wallpaper')->where($param)->order('disp')->findPage(12);
    	foreach ($data['data'] as &$value){
    		if($value['thumb']) $value['thumbpic']=$value['img'].'.thumb.jpg';
    		else $value['thumbpic']=$value['img'];
    	}
    	//重新格式化分页展示样式
    	$data['html'] = showPage($data['totalRows'],$data['nowPage'],$data['totalPages']);
    	
    	$data['classid'] = $classid;
    	$data['class'] = $class;
    	$this->assign($data);
    	$this->display();
    }
    
    /**
     +----------------------------------------------------------
     * 系统自定义相关设置（dock|topbar|window|browser|filemanage）
     +----------------------------------------------------------
     * @author 小波
     +----------------------------------------------------------
     * 创建时间：2013-3-22 上午11:43:35
     +----------------------------------------------------------
     */
    public function _sysDefined(){
    	$do = ACTION_NAME;
    	$param['idtype'] = $do;
    	$data = M('dsk_thameitem')->where($param)->order('disp')->findPage(16);
    	foreach ($data['data'] as &$value){
    		$value['thumb']=__THEME__.'/desktop/styles/'.($do=='topbar'?'navbar':$do).'/'.$value['folder'].'/thumb.jpg';
    	}
    	//重新格式化分页展示样式
    	$data['html'] = showPage($data['totalRows'],$data['nowPage'],$data['totalPages']);
    	$this->assign($data);
    }
    
    /**
     +----------------------------------------------------------
     * 顶部导航相关设置
     +----------------------------------------------------------
     * @author 小波
     +----------------------------------------------------------
     * 创建时间：2013-3-22 上午11:40:48
     +----------------------------------------------------------
     */
    public function topbar(){
    	$this->_sysDefined();
    	$this->display();
    }
    
    /**
     +----------------------------------------------------------
     * dock依靠样式相关设置
     +----------------------------------------------------------
     * @author 小波
     +----------------------------------------------------------
     * 创建时间：2013-3-22 上午11:40:48
     +----------------------------------------------------------
     */
    public function dock(){
    	$this->_sysDefined();
    	$this->display();
    }
    
    /**
     +----------------------------------------------------------
     * 窗体样式相关设置
     +----------------------------------------------------------
     * @author 小波
     +----------------------------------------------------------
     * 创建时间：2013-3-22 上午11:40:48
     +----------------------------------------------------------
     */
    public function window(){
    	$this->_sysDefined();
    	$this->display();
    }
    
    /**
     +----------------------------------------------------------
     * 资源管理器相关设置
     +----------------------------------------------------------
     * @author 小波
     +----------------------------------------------------------
     * 创建时间：2013-3-22 上午11:40:48
     +----------------------------------------------------------
     */
    public function filemanage(){
    	$this->_sysDefined();
    	$this->display();
    }
    
    /**
     +----------------------------------------------------------
     * 内部浏览器样式相关设置
     +----------------------------------------------------------
     * @author 小波
     +----------------------------------------------------------
     * 创建时间：2013-3-22 上午11:40:48
     +----------------------------------------------------------
     */
    public function browser(){
    	$this->_sysDefined();
    	$this->display();
    }
    
}
?>