<?php
/**
 +------------------------------------------------------------------------------
 * Web Desktop 用户模块Action
 +------------------------------------------------------------------------------
 * @category	desktop
 * @package		Lib/Action
 * @author		小波 <xiaobosun@gridinfo.com.cn>
 * @version		1.0
 +------------------------------------------------------------------------------
 * 创建时间 2013-3-18 上午08:16:54
 +------------------------------------------------------------------------------
 */
class SystemAction extends BaseAction{
	public function _initialize() {
		parent::_initialize();

	}

}
?>