<?php
/**
 * 
 +------------------------------------------------------------------------------
 * 圈子基本信息
 +------------------------------------------------------------------------------
 * @category	社交圈
 * @author		Snail <spsnail@163.com>
 * @version		1.0
 +------------------------------------------------------------------------------
 * 创建时间：	2013-11-21 上午9:12:47
 +------------------------------------------------------------------------------
 */
class SocietyVoteModel extends Model {
	var $tableName = 'society_vote';
	
	/**
	 * +----------------------------------------------------------
	 * 根据圈子编号获取圈子的基本信息
	 * +----------------------------------------------------------
	 * @param int $societyId      	
	 * @return array
	 * @author ssq 2014-1-6
	 * +----------------------------------------------------------
	 */
	function getVoteCountByParam($param) {
		$result = $this->where ( $param )->count();
		return $result;
	}
	
	/**
	 * ----------------------------------------------------------
	 * 投票
	 * ----------------------------------------------------------
	 * @param int $societyId
	 * @return array
	 * @author ssq 2014-1-6
	 * ----------------------------------------------------------
	 */
	function vote($param) {
		$result = $this
				->add($param);
		return $result;
	}

	/**
	 * +----------------------------------------------------------
	 * 根据圈子编号获取圈子的基本信息
	 * +----------------------------------------------------------
	 * @param int $societyId
	 * @return array
	 * @author ssq 2014-1-6
	 * +----------------------------------------------------------
	 */
	function getVoteCountBySocietyId($societyId) {
		$result = $this
				->where (array('societyId'=>$societyId))
				->group('toUid')
				->field('toUid,count(toUid)')
				->select();
		return $result;
	}
}
?>