<?php
/**
 * 
 +------------------------------------------------------------------------------
 * 用户信息
 +------------------------------------------------------------------------------
 * @category	用户信息
 * @author		ssq
 * @version		1.0
 +------------------------------------------------------------------------------
 * 创建时间：	2013-12-31 
 +------------------------------------------------------------------------------
 */
class UserOfModel extends Model {
	var $tableName	=	'user';
	
    /**
     +----------------------------------------------------------
     * 根据用户名模糊查询用户
     +----------------------------------------------------------
     * @param  string $userName int $page
     * @return array
     * @author ssq 2013-12-11
     +----------------------------------------------------------
     */
    function getSocietyBypara($userName,$page){
    	$limit = ($page-1)*21;
		$limit = $limit.",21";
		$map['uname'] = array('like','%'.$userName.'%');
		$result =$this
		        ->where($map)
		        ->limit($limit)
		        ->select();
		return $result;
	}
	
    /**
     +----------------------------------------------------------
     * 根据用户名模糊查询用户没有分页
     +----------------------------------------------------------
     * @param  string $userName int $page
     * @return array
     * @author ssq 2013-12-11
     +----------------------------------------------------------
     */
    function getSocietyByparaNoPage($userName){
		$map['uname'] = array('like','%'.$userName.'%');
		$result =$this
		        ->where($map)
		        ->select();
		return $result;
	}
}
?>